{
    "distros": {
        "arch": "Arch - это независимый дистрибутив, созданный с базовой установкой, которую пользователи могут настроить в соответствии со своими потребностями. У него роллинг-релиз (см. man rolling) что новые версии приложений становятся доступными по мере их выпуска разработчиками. Он также предлагает доступ к неподдерживаемому программному обеспечению в поддерживаемом сообществом Arch User Repository (AUR), что является большим преимущестом если пользоваться ним правильно.\n\nПреимущества Arch Linux\n• Благодаря ручной установке вы точно знаете, какие пакеты у вас есть и как работает дистрибутив.\n• Программное обеспечение обычно новее, чем в других дистрибутивах.\n• Если пакет недоступен в обычных репозиториях, то скорее всего вы найдете его в AUR.\n• Создавать собственные пакеты очень просто, если вы умеете писать на bash.\n• Pacman обычно быстрее менеджеров пакетов, таких как apt или dnf.\n\nНедостатки Arch Linux\n• Процесс установки полностью самостоятельный; никакой установки графического интерфейса.\n• Качество пакета AUR варьируется, поскольку оно поддерживается пользователем.\n• AUR официально не поддерживается, поэтому вы должны либо использовать помощник AUR, либо вручную следить за пакетами AUR.\n• Чтобы избежать проблем с обновлениями, список зеркал pacman необходимо обновлять как минимум раз в 2 недели.\n\nСтоит ли использовать Arch Linux?\nЕсли вам нужен хороший контроль над программным обеспечением вашего компьютера и вы подготовлены с навыками устранения неполадок в случае, если что-то сломается, Arch может быть для вас хорошим выбором. Однако будьте готовы провести собственное исследование и читать документацию прежде чем обращаться за помощью. Сообщество Arch обычно ожидает, что пользователи прочитают руководства, вики и онлайн-ресурсы, прежде чем обращаться за помощью. \nПожалуйста, просмотрите man rolling, если вы не уверены, готовы ли вы к выпуску скользящего выпуска.",
        "antergos": "• Не рекомендуемый дистрибутив из-за того, что часто возникают проблемы, которых нет в Arch Linux.\n• Поставляет настраиваемую программу приветствия LightDM, у которой были относительно частые проблемы.\n• Добавляет дополнительный репозиторий к базовым репозиториям Arch, содержащий множество сомнительных пакетов, включая:\n- yaourt (низкая активность и много проблем)\n- Метапакеты для окружений рабочего стола, которые доступны в репозиториях Arch по умолчанию.\n- Многие другие пакеты, доступные в репозиториях Arch по умолчанию или в AUR.\n• Утверждает, что «Antergos для всех». Прокручивающиеся дистрибутивы должны использоваться только людьми, хорошо разбирающимися в Linux.\n\nЕсли у вас нет опыта работы с Linux, мы настоятельно рекомендуем сначала установить дистрибутив с долгосрочной поддержкой. См. Sudo info  для списка рекомендуемых дистрибутивов для начинающих.\n\nЕсли вы думаете, что готовы к выпуску непрерывного выпуска дистрибутива, см. Sudo info rolling\n\nпереведено с Discord Linux (Англ.) https://discord.gg/discord-linux",
        "debian": "• Имеет три цикла выпуска:\n- Стабильный выпуск\n- Тестовый релиз (не рекомендуется к использованию)\n- Нестабильный (sid) релиз (точно не рекомендуется к использованию)\nДальше будет описываться только Стабильный выпуск.\n\nПреимущества:\n• Крайне стабилен, безопасен и универсален, что является его главным преимуществом.\n• Поддерживает разные платформы, как arm, aarch64, и x86-64\n• Пакеты как файлы .deb довольно распространены и облегчают установку приложении.\n• Использует менеджер пакетов apt, который относительно интуитивно понятен.\n\nЧто нужно учитывать:\n• Большие обновления приходят раз в 2 года, в остальное время обычно это обновления безопасности.\n• Как в Убунту, не имеет персональных репозиториев PPA\n\nВнимание!\nПакеты Debian крайне не рекомендуется использовать поверх Ubuntu и наоборот.\n\nЕсли вам нужно отполированное, стабильное решение для чего-либо, то вам стоит попробовать Debian. Поэтому ее и используют в серверах, и даже компания Canonical основывают свой дистрибутив Ubuntu от Debian-а.\n\nСм. man recommended и man ubuntu для получения дополнительной информации об Ubuntu и рекомендуемых вариациях Ubuntu.",
        "deepin": "• Не рекомендуемый дистрибутив Linux из-за постоянно повторяющихся проблем безопасности.\n• Поддерживает отдельные репозитории для всего программного обеспечения (включая ядро), часто устаревшего по сравнению с эквивалентами восходящего потока Debian.\n• Репозитории содержатся в плохом состоянии. Известно, что репозитории Deepin включают вещи, которые нельзя распространять вместе с другими странными вещами. Например, оболочка Discord от Blank больше не поддерживалась в их репозиториях для многих, даже несмотря на то, что в то время был доступен официальный клиент Linux Discord.\n• До недавнего времени данные о размере экрана, IP-адресах и физическом местонахождении пользователей передавались в виде открытого текста через Deepin App Store (видео) https://youtu.be/11QqMUgzuo0.\n\nМы рекомендуем установить Kubuntu вместо  Deepin и кастомизировать его под себя (см. man kubuntu).\n\nПереведено с Discord Linux https://discord.gg/discord-linux",
        "fedora": "Дистрибутив, спонсируемый корпорацией Red Hat, с частыми обновлениями. Выгодно для Red Hat тем что баги и ошибки находятся заранее в Fedora и только после патчей обновляют RHEL и CentOS.\n\nПреимущества\n• 6-месячный цикл выпуска с крайне частыми обновлениями, поэтому считается как полу-роллинг релиз, но среда рабочего стола и основные приложения обычно обновляются только с новым выпуском.\n• Считается, что Fedora предоставляет лучший опыт работы с GNOME - это основной \"спин\" и рекомендуемый способ использования Fedora.\n• Не боятся использовать последние технологии при новых релизах\n\nЧто нужно учесть:\n• На основе RPM с использованием dnf в качестве диспетчера пакетов, что работает немного медленнее (пару секунд, иногда больше) чем большинство других менеджеров пакетов\n• Репозиторий поставляется только с открытым исходным кодом и свободным программным обеспечением в официальных репозиториях, вам необходимо включить сторонние репозитории для всего с закрытым исходным кодом или с ограниченным лицензированием (гуглите RPM Fusion).\n• Большие релизы сильно отличаются и после обновлений могут появиться проблемы.\n• При достаточной кастомизации системы чаще появляются проблемы с обновлениями из-за разных версии библиотек, рекомендуем использовать Flatpak при возможности.\n\nЕсли вам хочется лучшего опыта GNOME из-под-коробки с последними обновлениями, то мы рекомендуем Fedora. Однако, не рекомендуется для новичков в Linux из-за цикла выпуска и настройки разделов по умолчанию.",
        "gentoo": "Самый известный дистрибутив на основе исходного кода (пакеты собираются на машине пользователя).\n\nПреимущества:\n• Наиболее примечательной особенностью являются USE-флаги, которые позволяют пользователям не только выбирать, какие пакеты установлены на их машине, но также и то, что каждый пакет будет поддерживать.\n• Компилированные пакеты работают производительнее и эффективнее чем готовые бинарные.\n• Поддерживает наложения, настраиваемые репозитории поверх официального репозитория.\n• Поддерживает OpenRC и systemd в качестве систем инициализации. Один выбирается во время установки и может быть изменен позже.\n\nЧто нужно учесть:\n• Установка и обновление пакетов для больших приложений может занять много времени. Эти приложения также могут иметь двоичную опцию, но вы теряете возможность настройки USE-флагов, выбирая двоичные пакеты.\n• Не подходит для новичков. Сообщество готово помочь тем, кто показывает, что они приложили усилия для решения проблемы, но те, кто не может / не имеет знаний, чтобы помочь себе, должны держаться подальше.\n\nЕсли вы хотите знать из чего состоит ваша система и вы готовы потратить время на компиляцию ради производительности, то вам стоит попробовать Gentoo. Изучение займет не один день, но ради ваших целей он может стать лучшим.",
        "kde neon": "KDE neon - это дистрибутив, основанный на последней версии Ubuntu LTS, в которой используются последние стабильные версии среды рабочего стола Plasma. KDE neon был создан бывшим руководителем проекта Kubuntu Джонатаном Ридделлом. Несмотря на то, что KDE neon не является официальным вариантом Ubuntu, он по-прежнему имеет доступ ко всем пакетам в репозиториях Ubuntu и может использовать PPA, созданные для Ubuntu.\n\nПреимущества KDE neon\n• Поддерживается самими разработчиками KDE.\n• Небольшой размер установки; около 1600 пакетов.\n• Предлагает самые свежие пакеты KDE на стабильной основе.\n• Plasma - это наиболее настраиваемая среда рабочего стола для Linux.\n• Более стабильный и современный, чем Kubuntu.\n\nНедостатки KDE neon\n• Очень частые обновления пакетов, поэтому могут не подойти людям, не разбирающимся в компьютерах.\n• Могут возникать ошибки из-за частых обновлений пакетов Plasma.\n\nСтоит ли использовать KDE neon?\nЕсли вы ищете последние стабильные пакеты KDE Plasma, KDE neon - это то, что вам нужно. KDE neon чрезвычайно гибок, стабилен и довольно прост в использовании. Используйте только пользовательскую версию KDE neon, поскольку две другие версии не предназначены для обычного использования.\nСкачать KDE neon\n\nОбновление KDE neon\n• Вместо использования apt upgrade рекомендуется использовать apt full-upgrade, чтобы избежать проблем с обновлениями.\n\nСм. \"man ubuntu\" для получения дополнительной информации об Ubuntu.",
        "kali": "Kali Linux не является общим дистрибутивом для всех и нацелен на создание готовых приложений для тестировании систем. Проект никак не связан с данным дистрибутивом и помогать на вопросы связанным с Kali не можем.\n\nК чтению: \nhttps://docs.kali.org/introduction/should-i-use-kali-linux",
        "lubuntu": "Lubuntu - это официальный вариант Ubuntu, использующий среду рабочего стола LXQt. Как и в случае со всеми официальными разновидностями Ubuntu, Lubuntu имеет доступ ко всем пакетам в репозиториях Ubuntu и может использовать PPA, созданные для Ubuntu.\n\nПреимущества:\n• Небольшая установка, по умолчанию установлено около 1500 пакетов.\n• Очень проста в использовании ЦП и ОЗУ.\n• Можно легко изменить оконный менеджер по умолчанию.\n\nЧто нужно учитывать:\n• Невозможно обновить с 18.04 до 20.04.\n• Наименее дружественный для новичков вариант Ubuntu.\n• Вариантов настройки LXQt крайне не хватает прямо из коробки; qt5ct требуется, чтобы действительно иметь возможность настраивать приложения Qt.\n• LXQt больше похож на набор инструментов, чем на реальную среду рабочего стола.\n• Команда, которая упаковывает Lubuntu, иногда создает сборки с ошибками.\n\nСтоит ли использовать Lubuntu?\nLubuntu - наименее дружественный для новичков вариант Ubuntu, поэтому у тех, кто не разбирается в компьютерах, могут возникнуть проблемы с настройкой по умолчанию. Из-за перечисленных выше недостатков мы не рекомендуем Lubuntu. Вместо этого мы рекомендуем Kubuntu (см. man kubuntu), поскольку он использует ресурсы, очень похожие на Lubuntu, и гораздо более удобен в использовании, или Xubuntu (см. man xubuntu) если вам нужно для крайне слабых компьютеров.",
        "mageia": "Mageia - это независимый дистрибутив Linux, созданный на основе Mandriva Linux. Он использует формат пакета RPM с urpmi в качестве менеджера пакетов. Mageia позволяет вам выбрать, какую среду рабочего стола или оконный менеджер вы хотите использовать в процессе установки.\n\nПреимущества:\n• Программа установки позволяет выбрать среду рабочего стола или оконный менеджер.\n• У установщика есть возможность установить драйверы для таких вещей, как графические процессоры.\n• Mageia Control Center - очень простой в использовании интерфейс для управления пакетами и настройками системы.\n• Имеет последние версии драйверов NVIDIA (в настоящее время 460.84) и пакет mageia-prime для настроек NVIDIA Optimus.\n• Имеет последнюю версию ядра (в настоящее время 5.13.12).\n\nЧто нужно учитывать:\n• urpmi разделен на несколько команд вместо аргументов и не очень интуитивно понятен в использовании, но dnf также устанавливается по умолчанию.\n• Сторонние репозитории для Mageia очень редки, поэтому могут возникнуть проблемы с поиском пакетов, которых нет в базовых репозиториях.\n• Независимость означает, что они не имеют финансовой поддержки со стороны корпорации и могут прекратить свое существование в любой момент.\n• Относительно новый дистрибутив, поэтому сложно судить о долгосрочной стабильности.\n• Некоторые странные настройки по умолчанию, например наличие отдельного домашнего раздела.\n• Использует ядро, отличное от LTS, и расписание обновлений ядра неизвестно.\n\nСтоит ли использовать Mageia?\nЕсли вы непротив идти в неизведанные воды и ищете дистрибутив с одним из лучших графических интерфейсов для управления пакетами и настройками системы, вам стоит попробовать Mageia. Подходит ли Mageia новичкам? На данный момент сложно сказать. Mageia действительно стремится быть дружелюбной к новичкам, и это проявляется во многих местах, но, поскольку это относительно новый и независимый дистрибутив, трудно судить о том, что их ждет в будущем.\n\nПереведено с Discord Linux https://discord.gg/discord-linux",
        "manjaro": "Дистрибутив, которое принесло Arch в массы, но не является Arch-ем, и продолжает создавать новый функционал. Manjaro стремится к удобству использования и к легкой установке новичкам, и его собственные инструменты упрощают работу с системой.\n\nПреимущества:\n• Доступ к репозитории AUR от pamac.\n• Легко и интуитивно установить, сравнивая с Arch Linux\n• Удобная кастомизация на уровне Arch Linux.\n• Последние обновления от Arch Linux\n• Уникальные утилиты для настройки системы\n\nЧто нужно учитвать:\n• Он называет себя «стабильным» выпуском, но на самом деле просто удерживает репозитории Arch Linux на пару недель.\n• Говорит, что Manjaro «подходит для новичков», но новички не должны использовать роллинг-релизы (см. man rolling).\n• Часто возникают проблемы с обновлениями, которые не бывают в Arch Linux.\n• Использует pamac в качестве помощника AUR, не давая пользователю никаких знаний о том, как правильно использовать AUR.\n• Частые проблемы с сертификатами SSL на своем веб-сайте.\n\nЕсли у вас нет опыта работы с Linux, мы настоятельно рекомендуем сначала установить дистрибутив с долгосрочной поддержкой. См. man recommended для списка рекомендуемых дистрибутивов для начинающих.\n\nЕсли вы думаете, что готовы к роллинг дистрибутивам, см. man rolling.",
        "mint": "• Не рекомендуемый дистрибутив Linux из-за того, что он не дает практически никакой выгоды по сравнению с использованием разновидности Ubuntu и, как правило, более ломан, чем Ubuntu и его разновидности.\n• Использует смесь собственных репозиториев и репозиториев Ubuntu для получения таких вещей, как ядро из репозиториев Ubuntu, вместо создания собственного ядра. Это может привести к тому, что пакеты из репозиториев Ubuntu заменят пакеты, которые были установлены из репозиториев Mint во время обновлений, что, скорее всего, сломает работу.\n• Известно, что пакеты Ubuntu и Debian смешиваются, в результате получается FrankenDebian.\n• Известны проблемы с обновлением между выпусками.\n• Веб-сайт дважды взломан; в одном из таких случаев вредоносное ПО распространялось в ISO-образах Linux Mint.",
        "slackware": "• Нет менеджера пакетов\n• Поддерживается буквально одним разработчиком (что будет, когда он выйдет на пенсию) \n• Последнее обновление было в 2016 и все еще разрабатывает новую версию 15.0\n• Зачем вам оно",
        "solus": "• Не рекомендуемый дистрибутив Linux из-за того, что он является «роллинг-релизом» (на самом деле не выпускается; обновляется только по пятницам), который может быть использован всеми. Дистрибутивы роллинг-релиз должны использоваться только людьми, хорошо разбирающимися в Linux.\n• Нет dkms. Невозможно автоматически перестроить модули для драйверов, которых нет в репозиториях.\n• Практически нет конфликтующих пакетов. Например,  пакеты wine-staging не может быть в репозиториях.\n• Нет рекомендуемых deps. Требуется любая необходимая упаковка.\n• Вместо того, чтобы предлагать открытое бета-тестирование, Patreon использовался в прошлом для бета-версий.\n\nЕсли у вас нет опыта работы с Linux, мы настоятельно рекомендуем сначала установить дистрибутив с долгосрочной поддержкой. См. man recommended для списка рекомендуемых дистрибутивов для начинающих.\n\nЕсли вы думаете, что готовы к выпуску непрерывного выпуска дистрибутива, см. man rolling",
        "windows": "• Встроенное отслеживание и рекламные объявления, которые трудно / невозможно отключить после обновления.\n• Предварительно загружены спонсируемые приложения и игры.\n• Стоимость использования после окончания пробного периода.\n- Редакции Enterprise и LTSB нельзя использовать более одного часа за раз по истечении пробного периода.\n• Настройка взаимодействия с пользователем крайне ограничена.\n• Нет настоящего менеджера пакетов из коробки.\n• Говорит что он универсален, однако требует мощностей современных компьютеров\n• Старые версии не поддерживаются, хоть вы за это и платите.\nСм. man recommended для списка рекомендуемых дистрибутивов Linux.",
        "kubuntu": "Kubuntu - официальный вариант Ubuntu, в котором используется среда рабочего стола KDE Plasma. Поскольку он использует плазму, это наиболее настраиваемый вариант Ubuntu. Как и в случае со всеми официальными разновидностями Ubuntu, Kubuntu имеет доступ ко всем пакетам в репозиториях Ubuntu и может использовать PPA, созданные для Ubuntu.\n\nПреимущества:\n• Достаточно небольшая установка с примерно 1800 установленными пакетами с минимальным вариантом установки.\n• Простота использования ЦП и ОЗУ.\n• По состоянию на 20.04 использует Plasma версии 5.18, которая очень стабильна и имеет множество функций.\n• Выпуск 20.04 намного лучше предыдущих выпусков Kubuntu.\n• Самый легко настраиваемый вариант Ubuntu.\n\nЧто нужно учесть:\n• Предыдущие выпуски, как известно, содержат относительно много ошибок и не дают хорошего опыта работы с Plasma.\n• Программное обеспечение Plasma будет иметь статическую версию в течение всего цикла выпуска.\n\nСтоит ли использовать Kubuntu?\nЕсли вы ищете один из самых настраиваемых дистрибутивов Linux, Kubuntu может быть для вас дистрибутивом. Kubuntu также легок в использовании и прост в использовании. В прошлом Kubuntu была известна наличием багов в программном обеспечении Plasma, но их выпуск 20.04 очень надежен и намного лучше предыдущих выпусков.\n\nЕсли вам нужен дистрибутив на основе Ubuntu с последней версией программного обеспечения Plasma, мы рекомендуем KDE neon (см. man kde neon).",
        "xubuntu": "Xubuntu - это официальный вариант Ubuntu, использующий среду рабочего стола Xfce. Часто считается, что это самый стабильный вариант Ubuntu. Как и в случае со всеми официальными разновидностями Ubuntu, Xubuntu имеет доступ ко всем пакетам в репозиториях Ubuntu и может использовать PPA, созданные для Ubuntu.\n\nПреимущества:\n• Достаточно небольшая установка, по умолчанию установлено около 1900 пакетов.\n• Не требователен к процессеру и ОЗУ.\n• Xfce всегда тщательно тестирует свое программное обеспечение перед выпуском релизов, поэтому обычно оно очень стабильно.\n• Очень легко настроить внешний вид и действия вещей через диспетчер настроек Xfce.\n\nНа что следует обратить внимание:\n• Настройки по умолчанию выглядят очень скромно, но их легко изменить.\n• Может показаться немного устаревшим по сравнению с другими средами рабочего стола.\n\nСтоит ли использовать Xubuntu?\nЕсли вы ищете дистрибутив Linux, не требующий больших ресурсов, очень простой в использовании, чрезвычайно стабильный и легко настраиваемый, лучше Xubuntu не найти. Единственные проблемы, которые могут возникнуть у некоторых людей с Xubuntu, - это внешний вид по умолчанию и медленный цикл выпуска Xfce, но внешний вид легко изменить, и цикл выпуска Xfce является основной причиной того, что Xubuntu более стабилен, чем другие варианты Ubuntu.\n\nЕсли вам нужно что-то более современное, чем Xubuntu, мы рекомендуем посмотреть Kubuntu (см. man kubuntu).",
        "void": "Независимый дистрибутив Linux, созданный бывшим разработчиком NetBSD. Разрабатывается сообществом и и является роллинг-релизом.\n\nПреимущества:\n• Использует runit вместо systemd, облегчая нагрузку на процессор (несильно) и ОЗУ (~50-80мб) и предоставляет свои решения по запуску системы и программ\n• Использует xbps в качестве диспетчера пакетов (скользящий выпуск) и систему запуска runit.\n• Официально поддерживается только открытое программное обеспечение, но для проприетарное пакетов доступен неофициальный репозиторий.\n• Первый дистрибутив с LibreSSL в качестве криптографической библиотеки.\n• Позволяет использовать как glibc, так и musl\n\nЧто нужно учитывать:\n- При установке с musl проприетарные программы скорее всего не будут работать, рекомендуем устанавливать с glibc\n\nПроблемы в прошлом (никак не влияет на дистрибутив):\n- Предыдущий руководитель проекта исчез без предупреждения.\n- Предыдущий руководитель проекта контролировал все активы Void Linux.\n- Void Linux пришлось восстановить контроль над своим github и создать новый URL-адрес для своего веб-сайта из-за этого.",
        "ubuntu": "Ubuntu - это периодически выпускаемый Linux с двумя циклами выпуска. Релизы LTS (нумерация - каждый четный год.04, т.е. 16.04, 18.04, 20.04) выпускаются каждые два года с промежуточными релизами. Версии LTS - это стабильные выпуски Ubuntu. Выпуски без LTS (каждый нечетный год.04) поддерживаются в течение 9 месяцев и не рекомендуются для обычного использования. Релизы без LTS часто используются для тестирования вещей, которые не работают в долгосрочной перспективе. Ubuntu использует менеджер пакетов apt, который относительно интуитивно понятен и хорошо работает в большинстве ситуаций.\n\nПреимущества:\n• Самый удобный для новичков дистрибутив Linux.\n• Самый известный и поддерживаемый дистрибутив Linux.\n• Выпуски Ubuntu LTS чрезвычайно стабильны и редко имеют серьезные проблемы.\n• Установка драйверов проще, чем в Windows, в большинстве случаев с помощью дополнительных драйверов в программном обеспечении и обновлениях.\n• Большинство приложений и игр, созданных для Linux, сначала тестируются и создаются для Ubuntu.\n• Обладает огромным сообществом с огромным количеством информации, которую легко найти через вашу любимую поисковую систему.\n• В базовых репозиториях доступно больше программного обеспечения, чем в большинстве других дистрибутивов.\n• Можно использовать PPA (личные архивы пакетов) для установки пакетов, не входящих в стандартные репозитории, или обновления пакетов до более новых версий.\n• Имеет две роллинг ветки ядра в выпусках LTS, которые можно использовать для поддержания ядра в более актуальном состоянии, чем стандартная ветвь ядра.\n\nЧто нужно учитывать\n• Поставляется с snapd и привязкой для gnome-system-monitor, установленной по умолчанию.\n• Стандартная Ubuntu поставляется с окружением рабочего стола GNOME, которое может потребовать слишком больших ресурсов для некоторых систем.\n• В GNOME отсутствуют многие параметры настройки, которые предоставляют другие среды рабочего стола.\n\nСтоит ли использовать Ubuntu?\nЕсли вы ищете дистрибутив Linux, который прост в использовании, хорошо поддерживается, очень стабилен и имеет множество доступного программного обеспечения, Ubuntu и его разновидности - лучший выбор. Большинство людей будут более довольны вариациями Ubuntu (см. Kubuntu и Xubuntu), чем стандартной Ubuntu, поскольку они проще в использовании системных ресурсов и гораздо более настраиваемы."
    },
    "content": {
        "youtubers": "idk",
        "instagram": "ikr"
    },
    "commands": {
        "man": "man man man"
    },
    "distros. opensuse\nLeap - это LTS-версия openSUSE. Он получает основные обновления каждые 32–46 месяцев": {
        "": "Leap - это LTS-версия openSUSE. Он получает основные обновления каждые 32–46 месяцев, а небольшие обновления - каждые 6–12 месяцев. openSUSE использует zypper в качестве диспетчера пакетов с RPM в качестве бэкэнда.\n\nПреимущества:\n• Имеет тенденцию быть более стабильным, чем большинство других дистрибутивов Linux, благодаря автоматизированной системе тестирования под названием openqa.\n• Небольшие обновления позволяют Leap чувствовать себя более актуальным, чем большинство выпусков дистрибутивов LTS.\n• zypper интуитивно понятен в использовании, но при этом остается быстрым и универсальным.\n• Программа установки позволяет выполнять множество настроек, например, настраивать устанавливаемые пакеты.\n• Использует YaST, который обеспечивает легкий доступ к параметрам конфигурации для многих утилит, таких как systemd, загрузчики, брандмауэр и другие.\n• Использует Open Build Service, который можно использовать для поиска пакетов, создания пакетов или даже изменения пакетов. zyp или сайт программного обеспечения можно использовать для поиска пакетов OBS.\n• Может быть обновлен до openSUSE Tumbleweed, если пользователь хочет перейти на роллинг-релиз.\n\nЧто нужно учесть:\n• Установщик менее интуитивно понятен, чем установщик Ubuntu, для таких вещей, как настройка двойной загрузки.\n• Файловая система BTRFS используется по умолчанию, что может привести к небольшим накладным расходам и не рекомендуется людям, не знакомым с ней из-за отличий от традиционных файловых систем, но ее можно легко изменить на ext4 в установщике.\n• Некоторые пакеты не могут быть включены в репозитории по умолчанию из-за проблем с лицензией, но репозиторий Packman (не pacman из Arch) используется для решения этой проблемы.\n\nСтоит ли использовать openSUSE Leap?\nЕсли вы ищете очень хорошо протестированный, стабильный дистрибутив, который позволяет вам легко установить собственный набор пакетов из коробки, openSUSE Leap может быть дистрибутивом для вас. Если вы опытный пользователь, вы, скорее всего, оцените, насколько легко взаимодействовать с дополнительными репозиториями с помощью zypper по сравнению с чем-то вроде apt. OBS можно использовать для поиска дополнительных или более актуальных пакетов, включая получение более нового ядра и версий MESA, если это необходимо."
    }
}